app/controllers/chat_entries_controller.rb

  def latest
    # Get the last chat entry from this connectionId
    @chat_entry = ChatEntry.where("connectionId = ?", params[:connectionId]).last
---
SELECT "chat_entries".* FROM "chat_entries" WHERE (connectionId = '70f8552bb46c7fc43a02f7f64ca0aa52600b5633') ORDER BY chat_entries.id DESC LIMIT 1

  def add
    # Create a new chat entry
    @chat_entry = ChatEntry.new
    @chat_entry.connectionId = params[:connectionId]
    @chat_entry.body = params[:body]

    @chat_entry.save
---
INSERT INTO "chat_entries" ("connectionId", "body", "created_at", "updated_at") VALUES ('03915fa90d975c199b5e33a0e2b4846b90f7c18d', ' sadfadsfsa asdf asdf', '2011-05-16 17:43:19.460362', '2011-05-16 17:43:19.460362')